MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA6T2AD3CFM/mcu.h
/* ========================================================  ADSHCR1  ======================================================== */
 #define R_ADC_B0_ADSHCR1_SHEN4_Pos            (0UL)          /*!< SHEN4 (Bit 0)                                         */
 #define R_ADC_B0_ADSHCR1_SHEN4_Msk            (0x1UL)        /*!< SHEN4 (Bitfield-Mask: 0x01)                           */
 #define R_ADC_B0_ADSHCR1_SHEN5_Pos            (1UL)          /*!< SHEN5 (Bit 1)                                         */
 #define R_ADC_B0_ADSHCR1_SHEN5_Msk            (0x2UL)        /*!< SHEN5 (Bitfield-Mask: 0x01)                           */
 #define R_ADC_B0_ADSHCR1_SHEN6_Pos            (2UL)          /*!< SHEN6 (Bit 2)                                         */
 #define R_ADC_B0_ADSHCR1_SHEN6_Msk            (0x4UL)        /*!< SHEN6 (Bitfield-Mask: 0x01)                           */
/* =======================================================  ADSHSTR1  ======================================================== */
 #define R_ADC_B0_ADSHSTR1_SHSST_Pos           (0UL)          /*!< SHSST (Bit 0)                                         */
 #define R_ADC_B0_ADSHSTR1_SHSST_Msk           (0xffUL)       /*!< SHSST (Bitfield-Mask: 0xff)                           */
 #define R_ADC_B0_ADSHSTR1_SHHST_Pos           (16UL)         /*!< SHHST (Bit 16)                                        */
 #define R_ADC_B0_ADSHSTR1_SHHST_Msk           (0x70000UL)    /*!< SHHST (Bitfield-Mask: 0x07)                           */
/* =======================================================  ADCALSHCR  ======================================================= */
 #define R_ADC_B0_ADCALSHCR_CALSHSST_Pos       (0UL)          /*!< CALSHSST (Bit 0)                                      */
 #define R_ADC_B0_ADCALSHCR_CALSHSST_Msk       (0xffUL)       /*!< CALSHSST (Bitfield-Mask: 0xff)                        */
 #define R_ADC_B0_ADCALSHCR_CALSHHST_Pos       (16UL)         /*!< CALSHHST (Bit 16)                                     */
 #define R_ADC_B0_ADCALSHCR_CALSHHST_Msk       (0x70000UL)    /*!< CALSHHST (Bitfield-Mask: 0x07)                        */
/* ========================================================  ADPGACR  ======================================================== */
 #define R_ADC_B0_ADPGACR_PGADEN_Pos           (1UL)          /*!< PGADEN (Bit 1)                                        */
 #define R_ADC_B0_ADPGACR_PGADEN_Msk           (0x2UL)        /*!< PGADEN (Bitfield-Mask: 0x01)                          */
 #define R_ADC_B0_ADPGACR_PGASEL1_Pos          (2UL)          /*!< PGASEL1 (Bit 2)                                       */
 #define R_ADC_B0_ADPGACR_PGASEL1_Msk          (0x4UL)        /*!< PGASEL1 (Bitfield-Mask: 0x01)                         */
 #define R_ADC_B0_ADPGACR_PGAENAMP_Pos         (3UL)          /*!< PGAENAMP (Bit 3)                                      */
 #define R_ADC_B0_ADPGACR_PGAENAMP_Msk         (0x8UL)        /*!< PGAENAMP (Bitfield-Mask: 0x01)                        */
 #define R_ADC_B0_ADPGACR_PGAGEN_Pos           (16UL)         /*!< PGAGEN (Bit 16)                                       */
 #define R_ADC_B0_ADPGACR_PGAGEN_Msk           (0x10000UL)    /*!< PGAGEN (Bitfield-Mask: 0x01)                          */
 #define R_ADC_B0_ADPGACR_PGADG_Pos            (20UL)         /*!< PGADG (Bit 20)                                        */
 #define R_ADC_B0_ADPGACR_PGADG_Msk            (0x300000UL)   /*!< PGADG (Bitfield-Mask: 0x03)                           */
 #define R_ADC_B0_ADPGACR_PGAGAIN_Pos          (24UL)         /*!< PGAGAIN (Bit 24)                                      */
 #define R_ADC_B0_ADPGACR_PGAGAIN_Msk          (0xf000000UL)  /*!< PGAGAIN (Bitfield-Mask: 0x0f)                         */
/* ======================================================  ADPGAMONCR  ======================================================= */
 #define R_ADC_B0_ADPGAMONCR_PGAMON_Pos        (0UL)          /*!< PGAMON (Bit 0)                                        */
 #define R_ADC_B0_ADPGAMONCR_PGAMON_Msk        (0x7UL)        /*!< PGAMON (Bitfield-Mask: 0x07)                          */
 #define R_ADC_B0_ADPGAMONCR_MONSEL0_Pos       (16UL)         /*!< MONSEL0 (Bit 16)                                      */
 #define R_ADC_B0_ADPGAMONCR_MONSEL0_Msk       (0x10000UL)    /*!< MONSEL0 (Bitfield-Mask: 0x01)                         */
 #define R_ADC_B0_ADPGAMONCR_MONSEL1_Pos       (17UL)         /*!< MONSEL1 (Bit 17)                                      */
 #define R_ADC_B0_ADPGAMONCR_MONSEL1_Msk       (0x20000UL)    /*!< MONSEL1 (Bitfield-Mask: 0x01)                         */
 #define R_ADC_B0_ADPGAMONCR_MONSEL2_Pos       (18UL)         /*!< MONSEL2 (Bit 18)                                      */
 #define R_ADC_B0_ADPGAMONCR_MONSEL2_Msk       (0x40000UL)    /*!< MONSEL2 (Bitfield-Mask: 0x01)                         */
 #define R_ADC_B0_ADPGAMONCR_MONSEL3_Pos       (19UL)         /*!< MONSEL3 (Bit 19)                                      */
 #define R_ADC_B0_ADPGAMONCR_MONSEL3_Msk       (0x80000UL)    /*!< MONSEL3 (Bitfield-Mask: 0x01)                         */
/* ========================================================  ADREFCR  ======================================================== */
 #define R_ADC_B0_ADREFCR_VDE_Pos              (0UL)          /*!< VDE (Bit 0)                                           */
 #define R_ADC_B0_ADREFCR_VDE_Msk              (0x1UL)        /*!< VDE (Bitfield-Mask: 0x01)                             */
/* ========================================================  ADDFSR0  ======================================================== */
 #define R_ADC_B0_ADDFSR0_DFSEL0_Pos           (0UL)          /*!< DFSEL0 (Bit 0)                                        */
 #define R_ADC_B0_ADDFSR0_DFSEL0_Msk           (0x3UL)        /*!< DFSEL0 (Bitfield-Mask: 0x03)                          */
 #define R_ADC_B0_ADDFSR0_DFSEL1_Pos           (8UL)          /*!< DFSEL1 (Bit 8)                                        */
 #define R_ADC_B0_ADDFSR0_DFSEL1_Msk           (0x300UL)      /*!< DFSEL1 (Bitfield-Mask: 0x03)                          */
 #define R_ADC_B0_ADDFSR0_DFSEL2_Pos           (16UL)         /*!< DFSEL2 (Bit 16)                                       */
 #define R_ADC_B0_ADDFSR0_DFSEL2_Msk           (0x30000UL)    /*!< DFSEL2 (Bitfield-Mask: 0x03)                          */
 #define R_ADC_B0_ADDFSR0_DFSEL3_Pos           (24UL)         /*!< DFSEL3 (Bit 24)                                       */
 #define R_ADC_B0_ADDFSR0_DFSEL3_Msk           (0x3000000UL)  /*!< DFSEL3 (Bitfield-Mask: 0x03)                          */
/* ========================================================  ADDFSR1  ======================================================== */
 #define R_ADC_B0_ADDFSR1_DFSEL0_Pos           (0UL)          /*!< DFSEL0 (Bit 0)                                        */
 #define R_ADC_B0_ADDFSR1_DFSEL0_Msk           (0x3UL)        /*!< DFSEL0 (Bitfield-Mask: 0x03)                          */
 #define R_ADC_B0_ADDFSR1_DFSEL1_Pos           (8UL)          /*!< DFSEL1 (Bit 8)                                        */
 #define R_ADC_B0_ADDFSR1_DFSEL1_Msk           (0x300UL)      /*!< DFSEL1 (Bitfield-Mask: 0x03)                          */
 #define R_ADC_B0_ADDFSR1_DFSEL2_Pos           (16UL)         /*!< DFSEL2 (Bit 16)                                       */
 #define R_ADC_B0_ADDFSR1_DFSEL2_Msk           (0x30000UL)    /*!< DFSEL2 (Bitfield-Mask: 0x03)                          */
 #define R_ADC_B0_ADDFSR1_DFSEL3_Pos           (24UL)         /*!< DFSEL3 (Bit 24)                                       */
 #define R_ADC_B0_ADDFSR1_DFSEL3_Msk           (0x3000000UL)  /*!< DFSEL3 (Bitfield-Mask: 0x03)                          */
/* =======================================================  ADUOFTR0  ======================================================== */
 #define R_ADC_B0_ADUOFTR0_UOFSET_Pos          (0UL)          /*!< UOFSET (Bit 0)                                        */
 #define R_ADC_B0_ADUOFTR0_UOFSET_Msk          (0xffffUL)     /*!< UOFSET (Bitfield-Mask: 0xffff)                        */
/* =======================================================  ADUOFTR1  ======================================================== */
 #define R_ADC_B0_ADUOFTR1_UOFSET_Pos          (0UL)          /*!< UOFSET (Bit 0)                                        */
 #define R_ADC_B0_ADUOFTR1_UOFSET_Msk          (0xffffUL)     /*!< UOFSET (Bitfield-Mask: 0xffff)                        */
/* =======================================================  ADUOFTR2  ======================================================== */
 #define R_ADC_B0_ADUOFTR2_UOFSET_Pos          (0UL)          /*!< UOFSET (Bit 0)                                        */
 #define R_ADC_B0_ADUOFTR2_UOFSET_Msk          (0xffffUL)     /*!< UOFSET (Bitfield-Mask: 0xffff)                        */
/* =======================================================  ADUOFTR3  ======================================================== */
 #define R_ADC_B0_ADUOFTR3_UOFSET_Pos          (0UL)          /*!< UOFSET (Bit 0)                                        */
 #define R_ADC_B0_ADUOFTR3_UOFSET_Msk          (0xffffUL)     /*!< UOFSET (Bitfield-Mask: 0xffff)                        */
/* =======================================================  ADUOFTR4  ======================================================== */
 #define R_ADC_B0_ADUOFTR4_UOFSET_Pos          (0UL)          /*!< UOFSET (Bit 0)                                        */
 #define R_ADC_B0_ADUOFTR4_UOFSET_Msk          (0xffffUL)     /*!< UOFSET (Bitfield-Mask: 0xffff)                        */
/* =======================================================  ADUOFTR5  ======================================================== */
 #define R_ADC_B0_ADUOFTR5_UOFSET_Pos          (0UL)          /*!< UOFSET (Bit 0)                                        */
 #define R_ADC_B0_ADUOFTR5_UOFSET_Msk          (0xffffUL)     /*!< UOFSET (Bitfield-Mask: 0xffff)                        */
/* =======================================================  ADUOFTR6  ======================================================== */
 #define R_ADC_B0_ADUOFTR6_UOFSET_Pos          (0UL)          /*!< UOFSET (Bit 0)                                        */
 #define R_ADC_B0_ADUOFTR6_UOFSET_Msk          (0xffffUL)     /*!< UOFSET (Bitfield-Mask: 0xffff)                        */
/* =======================================================  ADUOFTR7  ======================================================== */
 #define R_ADC_B0_ADUOFTR7_UOFSET_Pos          (0UL)          /*!< UOFSET (Bit 0)                                        */
 #define R_ADC_B0_ADUOFTR7_UOFSET_Msk          (0xffffUL)     /*!< UOFSET (Bitfield-Mask: 0xffff)                        */
/* ========================================================  ADUGTR0  ======================================================== */
 #define R_ADC_B0_ADUGTR0_UGAINF_Pos           (0UL)          /*!< UGAINF (Bit 0)                                        */
 #define R_ADC_B0_ADUGTR0_UGAINF_Msk           (0x3fffffUL)   /*!< UGAINF (Bitfield-Mask: 0x3fffff)                      */
 #define R_ADC_B0_ADUGTR0_UGAINI_Pos           (22UL)         /*!< UGAINI (Bit 22)                                       */
 #define R_ADC_B0_ADUGTR0_UGAINI_Msk           (0xc00000UL)   /*!< UGAINI (Bitfield-Mask: 0x03)                          */
/* ========================================================  ADUGTR1  ======================================================== */
 #define R_ADC_B0_ADUGTR1_UGAINF_Pos           (0UL)          /*!< UGAINF (Bit 0)                                        */
 #define R_ADC_B0_ADUGTR1_UGAINF_Msk           (0x3fffffUL)   /*!< UGAINF (Bitfield-Mask: 0x3fffff)                      */
 #define R_ADC_B0_ADUGTR1_UGAINI_Pos           (22UL)         /*!< UGAINI (Bit 22)                                       */
 #define R_ADC_B0_ADUGTR1_UGAINI_Msk           (0xc00000UL)   /*!< UGAINI (Bitfield-Mask: 0x03)                          */
/* ========================================================  ADUGTR2  ======================================================== */
 #define R_ADC_B0_ADUGTR2_UGAINF_Pos           (0UL)          /*!< UGAINF (Bit 0)                                        */
 #define R_ADC_B0_ADUGTR2_UGAINF_Msk           (0x3fffffUL)   /*!< UGAINF (Bitfield-Mask: 0x3fffff)                      */
 #define R_ADC_B0_ADUGTR2_UGAINI_Pos           (22UL)         /*!< UGAINI (Bit 22)                                       */
 #define R_ADC_B0_ADUGTR2_UGAINI_Msk           (0xc00000UL)   /*!< UGAINI (Bitfield-Mask: 0x03)                          */
/* ========================================================  ADUGTR3  ======================================================== */
 #define R_ADC_B0_ADUGTR3_UGAINF_Pos           (0UL)          /*!< UGAINF (Bit 0)                                        */
 #define R_ADC_B0_ADUGTR3_UGAINF_Msk           (0x3fffffUL)   /*!< UGAINF (Bitfield-Mask: 0x3fffff)                      */
 #define R_ADC_B0_ADUGTR3_UGAINI_Pos           (22UL)         /*!< UGAINI (Bit 22)                                       */
 #define R_ADC_B0_ADUGTR3_UGAINI_Msk           (0xc00000UL)   /*!< UGAINI (Bitfield-Mask: 0x03)                          */
/* ========================================================  ADUGTR4  ======================================================== */
 #define R_ADC_B0_ADUGTR4_UGAINF_Pos           (0UL)          /*!< UGAINF (Bit 0)                                        */
 #define R_ADC_B0_ADUGTR4_UGAINF_Msk           (0x3fffffUL)   /*!< UGAINF (Bitfield-Mask: 0x3fffff)                      */
 #define R_ADC_B0_ADUGTR4_UGAINI_Pos           (22UL)         /*!< UGAINI (Bit 22)                                       */
 #define R_ADC_B0_ADUGTR4_UGAINI_Msk           (0xc00000UL)   /*!< UGAINI (Bitfield-Mask: 0x03)                          */
/* ========================================================  ADUGTR5  ======================================================== */
 #define R_ADC_B0_ADUGTR5_UGAINF_Pos           (0UL)          /*!< UGAINF (Bit 0)                                        */
 #define R_ADC_B0_ADUGTR5_UGAINF_Msk           (0x3fffffUL)   /*!< UGAINF (Bitfield-Mask: 0x3fffff)                      */
 #define R_ADC_B0_ADUGTR5_UGAINI_Pos           (22UL)         /*!< UGAINI (Bit 22)                                       */
 #define R_ADC_B0_ADUGTR5_UGAINI_Msk           (0xc00000UL)   /*!< UGAINI (Bitfield-Mask: 0x03)                          */
/* ========================================================  ADUGTR6  ======================================================== */
 #define R_ADC_B0_ADUGTR6_UGAINF_Pos           (0UL)          /*!< UGAINF (Bit 0)                                        */
 #define R_ADC_B0_ADUGTR6_UGAINF_Msk           (0x3fffffUL)   /*!< UGAINF (Bitfield-Mask: 0x3fffff)                      */
 #define R_ADC_B0_ADUGTR6_UGAINI_Pos           (22UL)         /*!< UGAINI (Bit 22)                                       */
 #define R_ADC_B0_ADUGTR6_UGAINI_Msk           (0xc00000UL)   /*!< UGAINI (Bitfield-Mask: 0x03)                          */
/* ========================================================  ADUGTR7  ======================================================== */
 #define R_ADC_B0_ADUGTR7_UGAINF_Pos           (0UL)          /*!< UGAINF (Bit 0)                                        */
 #define R_ADC_B0_ADUGTR7_UGAINF_Msk           (0x3fffffUL)   /*!< UGAINF (Bitfield-Mask: 0x3fffff)                      */
 #define R_ADC_B0_ADUGTR7_UGAINI_Pos           (22UL)         /*!< UGAINI (Bit 22)                                       */
 #define R_ADC_B0_ADUGTR7_UGAINI_Msk           (0xc00000UL)   /*!< UGAINI (Bitfield-Mask: 0x03)                          */
/* ======================================================  ADLIMINTCR  ======================================================= */
 #define R_ADC_B0_ADLIMINTCR_LIMIEn_Pos        (0UL)          /*!< LIMIEn (Bit 0)                                        */
 #define R_ADC_B0_ADLIMINTCR_LIMIEn_Msk        (0x1ffUL)      /*!< LIMIEn (Bitfield-Mask: 0x1ff)                         */
/* =======================================================  ADLIMTR0  ======================================================== */
 #define R_ADC_B0_ADLIMTR0_LIML_Pos            (0UL)          /*!< LIML (Bit 0)                                          */
 #define R_ADC_B0_ADLIMTR0_LIML_Msk            (0xffffUL)     /*!< LIML (Bitfield-Mask: 0xffff)                          */
 #define R_ADC_B0_ADLIMTR0_LIMU_Pos            (16UL)         /*!< LIMU (Bit 16)                                         */
 #define R_ADC_B0_ADLIMTR0_LIMU_Msk            (0xffff0000UL) /*!< LIMU (Bitfield-Mask: 0xffff)                          */
/* =======================================================  ADLIMTR1  ======================================================== */
 #define R_ADC_B0_ADLIMTR1_LIML_Pos            (0UL)          /*!< LIML (Bit 0)                                          */
 #define R_ADC_B0_ADLIMTR1_LIML_Msk            (0xffffUL)     /*!< LIML (Bitfield-Mask: 0xffff)                          */
 #define R_ADC_B0_ADLIMTR1_LIMU_Pos            (16UL)         /*!< LIMU (Bit 16)                                         */
 #define R_ADC_B0_ADLIMTR1_LIMU_Msk            (0xffff0000UL) /*!< LIMU (Bitfield-Mask: 0xffff)                          */
/* =======================================================  ADLIMTR2  ======================================================== */
 #define R_ADC_B0_ADLIMTR2_LIML_Pos            (0UL)          /*!< LIML (Bit 0)                                          */
 #define R_ADC_B0_ADLIMTR2_LIML_Msk            (0xffffUL)     /*!< LIML (Bitfield-Mask: 0xffff)                          */
 #define R_ADC_B0_ADLIMTR2_LIMU_Pos            (16UL)         /*!< LIMU (Bit 16)                                         */
 #define R_ADC_B0_ADLIMTR2_LIMU_Msk            (0xffff0000UL) /*!< LIMU (Bitfield-Mask: 0xffff)                          */
/* =======================================================  ADLIMTR3  ======================================================== */
 #define R_ADC_B0_ADLIMTR3_LIML_Pos            (0UL)          /*!< LIML (Bit 0)                                          */
 #define R_ADC_B0_ADLIMTR3_LIML_Msk            (0xffffUL)     /*!< LIML (Bitfield-Mask: 0xffff)                          */
 #define R_ADC_B0_ADLIMTR3_LIMU_Pos            (16UL)         /*!< LIMU (Bit 16)                                         */
 #define R_ADC_B0_ADLIMTR3_LIMU_Msk            (0xffff0000UL) /*!< LIMU (Bitfield-Mask: 0xffff)                          */
/* =======================================================  ADLIMTR4  ======================================================== */
 #define R_ADC_B0_ADLIMTR4_LIML_Pos            (0UL)          /*!< LIML (Bit 0)                                          */
 #define R_ADC_B0_ADLIMTR4_LIML_Msk            (0xffffUL)     /*!< LIML (Bitfield-Mask: 0xffff)                          */
 #define R_ADC_B0_ADLIMTR4_LIMU_Pos            (16UL)         /*!< LIMU (Bit 16)                                         */
 #define R_ADC_B0_ADLIMTR4_LIMU_Msk            (0xffff0000UL) /*!< LIMU (Bitfield-Mask: 0xffff)                          */
/* =======================================================  ADLIMTR5  ======================================================== */
 #define R_ADC_B0_ADLIMTR5_LIML_Pos            (0UL)          /*!< LIML (Bit 0)                                          */
 #define R_ADC_B0_ADLIMTR5_LIML_Msk            (0xffffUL)     /*!< LIML (Bitfield-Mask: 0xffff)                          */
 #define R_ADC_B0_ADLIMTR5_LIMU_Pos            (16UL)         /*!< LIMU (Bit 16)                                         */
 #define R_ADC_B0_ADLIMTR5_LIMU_Msk            (0xffff0000UL) /*!< LIMU (Bitfield-Mask: 0xffff)                          */
/* =======================================================  ADLIMTR6  ======================================================== */
 #define R_ADC_B0_ADLIMTR6_LIML_Pos            (0UL)          /*!< LIML (Bit 0)                                          */
 #define R_ADC_B0_ADLIMTR6_LIML_Msk            (0xffffUL)     /*!< LIML (Bitfield-Mask: 0xffff)                          */
 #define R_ADC_B0_ADLIMTR6_LIMU_Pos            (16UL)         /*!< LIMU (Bit 16)                                         */
 #define R_ADC_B0_ADLIMTR6_LIMU_Msk            (0xffff0000UL) /*!< LIMU (Bitfield-Mask: 0xffff)                          */
/* =======================================================  ADLIMTR7  ======================================================== */
 #define R_ADC_B0_ADLIMTR7_LIML_Pos            (0UL)          /*!< LIML (Bit 0)                                          */
 #define R_ADC_B0_ADLIMTR7_LIML_Msk            (0xffffUL)     /*!< LIML (Bitfield-Mask: 0xffff)                          */
 #define R_ADC_B0_ADLIMTR7_LIMU_Pos            (16UL)         /*!< LIMU (Bit 16)                                         */
 #define R_ADC_B0_ADLIMTR7_LIMU_Msk            (0xffff0000UL) /*!< LIMU (Bitfield-Mask: 0xffff)                          */
/* =======================================================  ADCMPENR  ======================================================== */
 #define R_ADC_B0_ADCMPENR_CMPENn_Pos          (0UL)          /*!< CMPENn (Bit 0)                                        */
 #define R_ADC_B0_ADCMPENR_CMPENn_Msk          (0xffUL)       /*!< CMPENn (Bitfield-Mask: 0xff)                          */
/* ======================================================  ADCMPINTCR  ======================================================= */
 #define R_ADC_B0_ADCMPINTCR_CMPIEn_Pos        (0UL)          /*!< CMPIEn (Bit 0)                                        */
 #define R_ADC_B0_ADCMPINTCR_CMPIEn_Msk        (0xfUL)        /*!< CMPIEn (Bitfield-Mask: 0x0f)                          */
/* =======================================================  ADCCMPCR0  ======================================================= */
 #define R_ADC_B0_ADCCMPCR0_CCMPCND_Pos        (0UL)          /*!< CCMPCND (Bit 0)                                       */
 #define R_ADC_B0_ADCCMPCR0_CCMPCND_Msk        (0x3UL)        /*!< CCMPCND (Bitfield-Mask: 0x03)                         */
 #define R_ADC_B0_ADCCMPCR0_CCMPTBLm_Pos       (16UL)         /*!< CCMPTBLm (Bit 16)                                     */
 #define R_ADC_B0_ADCCMPCR0_CCMPTBLm_Msk       (0xff0000UL)   /*!< CCMPTBLm (Bitfield-Mask: 0xff)                        */
/* =======================================================  ADCCMPCR1  ======================================================= */
 #define R_ADC_B0_ADCCMPCR1_CCMPCND_Pos        (0UL)          /*!< CCMPCND (Bit 0)                                       */
 #define R_ADC_B0_ADCCMPCR1_CCMPCND_Msk        (0x3UL)        /*!< CCMPCND (Bitfield-Mask: 0x03)                         */
 #define R_ADC_B0_ADCCMPCR1_CCMPTBLm_Pos       (16UL)         /*!< CCMPTBLm (Bit 16)                                     */
 #define R_ADC_B0_ADCCMPCR1_CCMPTBLm_Msk       (0xff0000UL)   /*!< CCMPTBLm (Bitfield-Mask: 0xff)                        */
/* =======================================================  ADCMPMDR0  ======================================================= */
 #define R_ADC_B0_ADCMPMDR0_CMPMD0_Pos         (0UL)          /*!< CMPMD0 (Bit 0)                                        */
 #define R_ADC_B0_ADCMPMDR0_CMPMD0_Msk         (0x3UL)        /*!< CMPMD0 (Bitfield-Mask: 0x03)                          */
 #define R_ADC_B0_ADCMPMDR0_CMPMD1_Pos         (8UL)          /*!< CMPMD1 (Bit 8)                                        */
 #define R_ADC_B0_ADCMPMDR0_CMPMD1_Msk         (0x300UL)      /*!< CMPMD1 (Bitfield-Mask: 0x03)                          */
 #define R_ADC_B0_ADCMPMDR0_CMPMD2_Pos         (16UL)         /*!< CMPMD2 (Bit 16)                                       */
